[
    { 
        "id": 1, 
        "number": 13, 
        "first_name": "Brock", 
        "last_name": "Purdy", 
        "position": "Quarterback", 
        "height": "6-1", 
        "weight": 220, 
        "age": 23, 
        "experience": 1, 
        "college": "Iowa State", 
        "description": "Brock Purdy rose to fame after taking over as the starting quarterback for the 49ers and leading them to the playoffs. Off the field, he is known for his humility and down-to-earth personality, often engaging with fans on social media. Purdy has also been active in supporting youth sports programs in Iowa, providing mentorship to aspiring quarterbacks.", 
        "season_rank": 5 
    },
    { 
        "id": 2, 
        "number": 23, 
        "first_name": "Christian", 
        "last_name": "McCaffrey", 
        "position": "Running Back", 
        "height": "5-11", 
        "weight": 205, 
        "age": 27, 
        "experience": 6, 
        "college": "Stanford", 
        "description": "Known for his versatility, Christian McCaffrey is a fan favorite due to his ability to make explosive plays in both the running and receiving game. He is also deeply involved in charity work, focusing on initiatives that support children's education and fitness programs. McCaffrey's foundation often hosts events to raise money for pediatric cancer research.", 
        "season_rank": 1 
    },
    { 
        "id": 3, 
        "number": 85, 
        "first_name": "George", 
        "last_name": "Kittle", 
        "position": "Tight End", 
        "height": "6-4", 
        "weight": 250, 
        "age": 29, 
        "experience": 6, 
        "college": "Iowa", 
        "description": "George Kittle is beloved by fans not only for his exceptional play on the field but also for his infectious personality. A passionate advocate for mental health, Kittle often speaks about the importance of mental wellness, and he works with organizations that provide resources for mental health support. His entertaining interactions with fans and teammates make him a fan favorite.", 
        "season_rank": 3 
    },
    { 
        "id": 4, 
        "number": 97, 
        "first_name": "Nick", 
        "last_name": "Bosa", 
        "position": "Defensive End", 
        "height": "6-4", 
        "weight": 266, 
        "age": 25, 
        "experience": 4, 
        "college": "Ohio State", 
        "description": "Nick Bosa is known for his relentless work ethic and incredible pass-rushing ability. Off the field, he stays humble, often spending his downtime volunteering with local youth football teams. Bosa has a deep love for the game, and his charitable endeavors focus on helping underprivileged kids get involved in sports.", 
        "season_rank": 2 
    },
    { 
        "id": 5, 
        "number": 54, 
        "first_name": "Fred", 
        "last_name": "Warner", 
        "position": "Linebacker", 
        "height": "6-3", 
        "weight": 230, 
        "age": 26, 
        "experience": 5, 
        "college": "BYU", 
        "description": "Fred Warner has emerged as one of the top linebackers in the NFL, known for his leadership on and off the field. He is involved in community service, particularly in providing mentorship to young athletes. Fans admire his commitment to the game and his charitable efforts, especially his work with organizations focused on education and community development.", 
        "season_rank": 4 
    },
    { 
        "id": 6, 
        "number": 7, 
        "first_name": "Ray-Ray", 
        "last_name": "McCloud", 
        "position": "Wide Receiver", 
        "height": "5-9", 
        "weight": 190, 
        "age": 26, 
        "experience": 4, 
        "college": "Clemson", 
        "description": "Ray-Ray McCloud is known for his speed and agility on the field, but also for his community involvement. He frequently hosts events for local youth, helping to inspire the next generation of athletes. McCloud is also an advocate for mental health awareness, sharing his personal experiences to encourage others to seek help when needed.", 
        "season_rank": 12 
    },
    { 
        "id": 7, 
        "number": 5, 
        "first_name": "Trey", 
        "last_name": "Lance", 
        "position": "Quarterback", 
        "height": "6-4", 
        "weight": 224, 
        "age": 23, 
        "experience": 2, 
        "college": "North Dakota State", 
        "description": "Trey Lance has a bright future ahead, known for his strong arm and versatility. While his rookie season was cut short, Lance remains a popular figure, often working with local charities to support at-risk youth. Fans appreciate his humble approach and his commitment to giving back to his community.", 
        "season_rank": 14 
    },
    { 
        "id": 8, 
        "number": 11, 
        "first_name": "Brandon", 
        "last_name": "Aiyuk", 
        "position": "Wide Receiver", 
        "height": "6-0", 
        "weight": 200, 
        "age": 25, 
        "experience": 3, 
        "college": "Arizona State", 
        "description": "Brandon Aiyuk has quickly become a fan favorite thanks to his playmaking ability and charismatic personality. Aiyuk is involved in charity events that promote education and healthy living, and he's a frequent guest at local youth football camps, where he shares his journey to success with young athletes.", 
        "season_rank": 7 
    },
    { 
        "id": 9, 
        "number": 29, 
        "first_name": "Talanoa", 
        "last_name": "Hufanga", 
        "position": "Safety", 
        "height": "6-0", 
        "weight": 200, 
        "age": 23, 
        "experience": 2, 
        "college": "USC", 
        "description": "Talanoa Hufanga's hard-hitting style and playmaking abilities make him a fan favorite. He's well known for his community outreach, especially in Hawaii, where he organizes football camps for young athletes. Fans love his down-to-earth personality and his ability to make crucial plays in high-stakes situations.", 
        "season_rank": 10 
    },
    { 
        "id": 10, 
        "number": 19, 
        "first_name": "Deebo", 
        "last_name": "Samuel", 
        "position": "Wide Receiver", 
        "height": "6-0", 
        "weight": 215, 
        "age": 27, 
        "experience": 4, 
        "college": "South Carolina", 
        "description": "Deebo Samuel is a fan favorite for his electrifying plays and versatility on offense. He is also known for his strong ties to his hometown, where he runs youth sports camps for local children. Fans love Deebo's fun-loving spirit, especially his unique celebrations after big plays.", 
        "season_rank": 6 
    },
    { 
        "id": 11, 
        "number": 9, 
        "first_name": "Robbie", 
        "last_name": "Gould", 
        "position": "Kicker", 
        "height": "6-0", 
        "weight": 190, 
        "age": 40, 
        "experience": 18, 
        "college": "Penn State", 
        "description": "Robbie Gould is a veteran kicker whose consistency in high-pressure situations has earned him widespread respect. Off the field, he’s active in charity events supporting military veterans and children’s hospitals. Gould also has a reputation for his humorous personality and connection with fans.", 
        "season_rank": 15 
    },
    { 
        "id": 12, 
        "number": 44, 
        "first_name": "Kyle", 
        "last_name": "Juszczyk", 
        "position": "Fullback", 
        "height": "6-1", 
        "weight": 235, 
        "age": 32, 
        "experience": 9, 
        "college": "Harvard", 
        "description": "Kyle Juszczyk is known for his leadership and versatility in the backfield. Beyond football, Juszczyk is a supporter of environmental causes and has participated in several charity drives for sustainability. Fans appreciate his hardworking demeanor and his genuine interactions with them after games.", 
        "season_rank": 9 
    },
    { 
        "id": 13, 
        "number": 74, 
        "first_name": "Mike", 
        "last_name": "McGlinchey", 
        "position": "Offensive Tackle", 
        "height": "6-8", 
        "weight": 310, 
        "age": 28, 
        "experience": 5, 
        "college": "Notre Dame", 
        "description": "Mike McGlinchey is known for his dominance on the offensive line and his leadership in the locker room. Off the field, he works closely with organizations dedicated to feeding the hungry and supporting underserved communities. His fans admire his down-to-earth personality and his commitment to giving back.", 
        "season_rank": 13 
    },
    { 
        "id": 14, 
        "number": 65, 
        "first_name": "Aaron", 
        "last_name": "Banks", 
        "position": "Guard", 
        "height": "6-5", 
        "weight": 325, 
        "age": 25, 
        "experience": 2, 
        "college": "Notre Dame", 
        "description": "Aaron Banks is known for his physicality and consistency on the offensive line. Outside of football, he has been involved in youth mentorship programs, helping local kids develop discipline and work ethic. Fans appreciate his humble attitude and his community involvement.", 
        "season_rank": 11 
    },
    { 
        "id": 15, 
        "number": 71, 
        "first_name": "Trent", 
        "last_name": "Williams", 
        "position": "Tackle", 
        "height": "6-5", 
        "weight": 320, 
        "age": 35, 
        "experience": 13, 
        "college": "Oklahoma", 
        "description": "Trent Williams is one of the league's top offensive tackles and an integral part of the 49ers' offense. Off the field, he enjoys working with charity organizations that focus on helping underprivileged youth. His leadership on and off the field has made him a respected figure in the 49ers' community.", 
        "season_rank": 8 
    },
    { 
        "id": 16, 
        "number": 10, 
        "first_name": "Jimmy", 
        "last_name": "Garoppolo", 
        "position": "Quarterback", 
        "height": "6-2", 
        "weight": 225, 
        "age": 31, 
        "experience": 8, 
        "college": "Eastern Illinois", 
        "description": "Known for his leadership and clutch performances, Jimmy Garoppolo has a special place in 49ers fans' hearts. Jimmy is also involved in multiple charitable causes, including those supporting children with cancer and veterans' groups. His strong connection with fans has made him a beloved figure in the Bay Area.", 
        "season_rank": 16 
    }
]
